#+title:   Terraform
#+startup: content

*** Verify our work
#+begin_src sh :results output verbatim
ls -alh
#+end_src

#+results:
#+begin_example
total 53K
drwxr-xr-x  2 jcf  users    9 Oct  9 23:39 .
drwx------ 10 jcf  users   17 Oct  9 23:29 ..
-rw-r--r--  1 root root  4.1K Oct  9 23:39 ca.crt
-rw-------  1 root root  1.7K Oct  9 23:39 ca.key
#+end_example

*** Verify our work
#+begin_src sh :results output verbatim
ls -alh
#+end_src

#+results:
#+begin_example
total 57K
drwxr-xr-x  2 jcf  users   10 Oct  9 23:42 .
drwx------ 10 jcf  users   17 Oct  9 23:29 ..
-rw-r--r--  1 root root  4.1K Oct  9 23:39 ca.crt
-rw-------  1 root root  1.7K Oct  9 23:39 ca.key
-rw-r--r--  1 root root    41 Oct  9 23:42 ca.srl
-rw-r--r--  1 root root  4.0K Oct  9 23:42 server.crt
-rw-r--r--  1 jcf  users 3.3K Oct  9 23:41 server.csr
-rw-------  1 jcf  users 1.7K Oct  9 23:41 server.key
#+end_example

*** Verify our work
#+begin_src sh :results output verbatim
ls -alh
#+end_src

#+results:
#+begin_example
total 62K
drwxr-xr-x  2 jcf  users   11 Oct  9 23:45 .
drwx------ 10 jcf  users   17 Oct  9 23:29 ..
-rw-r--r--  1 root root  4.1K Oct  9 23:39 ca.crt
-rw-------  1 root root  1.7K Oct  9 23:39 ca.key
-rw-r--r--  1 root root    41 Oct  9 23:45 ca.srl
-rw-r--r--  1 root root  4.0K Oct  9 23:45 client.crt
-rw-r--r--  1 jcf  users 3.3K Oct  9 23:44 client.csr
-rw-------  1 jcf  users 1.7K Oct  9 23:44 client.key
-rw-r--r--  1 root root  4.0K Oct  9 23:42 server.crt
-rw-r--r--  1 jcf  users 3.3K Oct  9 23:41 server.csr
-rw-------  1 jcf  users 1.7K Oct  9 23:41 server.key
#+end_example

